#include <iostream>
using namespace std;

int main() {
    int n;
    cout << "Введіть ціле число: ";
    cin >> n;

    int sum = 0;      // зберігає суму всіх цифр числа
    int digits = 0;   // рахує, скільки всього цифр у числі
    int temp = n;     // копія числа n, щоб працювати з ним і не змінювати оригінал
    

    // цикл закінчуєтся коли доходить до нуля
    while (temp != 0) {
        int rudenko = temp % 10; // бере останню цифру числа || 123 ÷ 10 = 12, остаток = 3
        sum += rudenko; // додає її до суми
        digits++; // рахуємо, скільки цифр вже пройшли           
        temp /= 10; // відкидає останню цифру числа, дробова частина ігнорується бо тип int, і ми йдемо до наступної цифри
    }

    cout << "Кількість цифр: " << digits << endl;
    cout << "Сума цифр: " << sum << endl;

    return 0;
}
