#include <iostream>
#include <string>
using namespace std;

// Визначити суму чисел, які кратні 3 та 5 одночасно, із заданого діапазону. Діапазон задається двома змінними (початок
// діапазону, кінець діапазону включно). 
// 12-63 = 15,30,45,60



int main() {
    int start;
    int end;

    cout << "Введіть перше число яке буде кратне 3 та 5 одночасно: ";
    cin >> start;

    cout << "Введіть друге число яке буде кратне 3 та 5 одночасно: ";
    cin >> end;

    int sum = 0;

    for (int i = start; i <= end; i++) { // цикл йде с старта и кожен раз збільшує і++
        if(i % 3 == 0 && i % 5 == 0) { // якщо на 3 і на 5 ділиться одночасно то це істина(наприклад 15 % 3 = 0 | 15 30 45 60...)
            sum += i; 
        }   
    }
    cout << "Сумма: " << sum << endl;
    string rudenko = "робота Руденка Максима 034";
    cout << rudenko;


    return 0;

}